In [1]:
import pandas as pd
sales = pd.read_csv('Week_sales.csv', index_col =0)

In [2]:
sales

        Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Mike         6        3          1         3       3         4       2
John         3        9          8         5      10         6       5
Sarah        7        2          8         9       9         4       2
Amanda       2        4          5         6       6         4       6

In [3]:
sales.min(axis = 0)

Monday       2
Tuesday      2
Wednesday    1
Thursday     3
Friday       3
Saturday     4
Sunday       2
dtype: int64

In [4]:
def range(series):
    return series.max() - series.min()

In [5]:
sales.apply(lambda x: x.sum(), axis = 1)

Mike      22
John      46
Sarah     41
Amanda    33
dtype: int64

In [6]:
import pandas as pd
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])

In [7]:
df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [8]:
df['Total'] = df.apply(lambda x: x.sum(), axis = 1)

In [10]:
df.loc['Row 5'] = df.apply(lambda x: x.sum(), axis = 0)

In [12]:
df.loc

In [13]:
df['D'] = df['A'] * df['B']

In [14]:
df

        A    B    C  Total     D
Row 1   1   10   20     31    10
Row 2   2   20   40     62    40
Row 3   3   30   60     93    90
Row 4   4   40   80    124   160
Row 5  10  100  200    310  1000

In [15]:
income = pd.read_csv('Gender_Income.csv', index_col =0)

In [16]:
income

        Age  Income  Expenses
Sex
Female   28      23        10
Male     29      33         8
Male     32      54        10
Female   32      37        10
Male     33      50        24
...     ...     ...       ...
Female   29      52        12
Male     32      55        13
Male     28      41        10
Male     29      14         7
Male     30      17        19

[237 rows x 3 columns]

In [27]:
income_mean = income.groupby('Sex').mean()

In [28]:
income_mean

              Age     Income  Expenses
Sex
Female  28.071429  31.366071  9.946429
Male    27.944000  32.064000  9.608000

In [31]:
Income_Per_Age = income.groupby('Age').Income.mean()

In [32]:
Income_Per_Age

Age
22    14.000000
23    17.095238
24    22.294118
25    20.466667
26    25.600000
27    27.428571
28    32.896552
29    35.214286
30    33.210526
31    44.240000
32    44.611111
33    44.000000
Name: Income, dtype: float64